; domain
(define (domain travel-planning)
  (:requirements :typing :action-costs)
  
  (:types
    location - object
  )
  
  (:predicates
    (at ?loc - location)
    (passed-security)
    (boarded)
  )
  
  (:functions
    (total-cost)
  )
  
  (:action take-taxi
    :parameters (?from ?to - location)
    :precondition (and 
                    (at ?from)
                    (= ?from home)
                    (= ?to airport)
                  )
    :effect (and 
              (not (at ?from))
              (at ?to)
              (increase (total-cost) 10) ; taxi is more expensive
            )
  )
  
  (:action take-bus-to-terminal
    :parameters (?from ?to - location)
    :precondition (and 
                    (at ?from)
                    (= ?from home)
                    (= ?to bus-terminal)
                  )
    :effect (and 
              (not (at ?from))
              (at ?to)
              (increase (total-cost) 1)
            )
  )
  
  (:action take-bus-to-airport
    :parameters (?from ?to - location)
    :precondition (and 
                    (at ?from)
                    (= ?from bus-terminal)
                    (= ?to airport)
                  )
    :effect (and 
              (not (at ?from))
              (at ?to)
              (increase (total-cost) 1)
            )
  )
  
  (:action walk-to-security
    :parameters (?from ?to - location)
    :precondition (and 
                    (at ?from)
                    (= ?from airport)
                    (= ?to security)
                  )
    :effect (and 
              (not (at ?from))
              (at ?to)
              (increase (total-cost) 1)
            )
  )
  
  (:action go-through-security
    :parameters (?from ?to - location)
    :precondition (and 
                    (at ?from)
                    (= ?from security)
                    (= ?to post-security)
                    (not (passed-security))
                  )
    :effect (and 
              (not (at ?from))
              (at ?to)
              (passed-security)
              (increase (total-cost) 1)
            )
  )
  
  (:action walk-to-gate
    :parameters (?from ?to - location)
    :precondition (and 
                    (at ?from)
                    (= ?from post-security)
                    (= ?to gate)
                    (passed-security)
                  )
    :effect (and 
              (not (at ?from))
              (at ?to)
              (increase (total-cost) 1)
            )
  )
  
  (:action board-flight
    :parameters (?loc - location)
    :precondition (and 
                    (at ?loc)
                    (= ?loc gate)
                    (passed-security)
                    (not (boarded))
                  )
    :effect (and 
              (boarded)
              (increase (total-cost) 1)
            )
  )
)

; problem
(define (problem travel-to-airport)
  (:domain travel-planning)
  
  (:objects
    home airport bus-terminal security post-security gate - location
  )
  
  (:init
    (at home)
    (= (total-cost) 0)
  )
  
  (:goal
    (boarded)
  )
  
  (:metric minimize (total-cost))
)

; plan
1. (take-bus-to-terminal home bus-terminal)
   deleted: (at home)
   added: (at bus-terminal)
   goals met: 0 of 1
2. (take-bus-to-airport bus-terminal airport)
   deleted: (at bus-terminal)
   added: (at airport)
   goals met: 0 of 1
3. (walk-to-security airport security)
   deleted: (at airport)
   added: (at security)
   goals met: 0 of 1
4. (go-through-security security post-security)
   deleted: (at security)
   added: (at post-security) (passed-security)
   goals met: 0 of 1
5. (walk-to-gate post-security gate)
   deleted: (at post-security)
   added: (at gate)
   goals met: 0 of 1
6. (board-flight gate)
   added: (boarded)
   goals met: 1 of 1
